
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ДенежныеСредстваНаличные Приход
	Движения.ДенежныеСредстваНаличные.Записывать = Истина;
	Для Каждого ТекСтрокаРасшифровкаПлатежа Из РасшифровкаПлатежа Цикл
		Движение = Движения.ДенежныеСредстваНаличные.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Валюта = Валюта;
		Движение.Сумма = ТекСтрокаРасшифровкаПлатежа.Сумма;
		Движение.СуммаРегл = ТекСтрокаРасшифровкаПлатежа.Сумма;
		Движение.СтатьяДвиженияДенежныхСредств = ТекСтрокаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств;
	КонецЦикла;

КонецПроцедуры
